Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: A custom combination is a hotkey that combines two keys which aren't normally meant to be used in combination.
ja: カスタムコンビネーションとは、通常は組み合わせて使用することを想定していない2つのキーを組み合わせたホットキーのことです。

source: A dynamic variable reference takes a text value and interprets it as the name of a variable.
ja: 動的変数参照は、テキスト値を受け取り、それを変数名として解釈します。

source: A function is the basic means by which a script does something.
ja: 関数とは、スクリプトが何かを行うための基本的な手段です。

source: A method is a function associated with a specific object or type of object.
ja: メソッドは、特定のオブジェクトまたはオブジェクトの種類に関連する機能です。

source: A nested function is one defined inside another function.
ja: ネストされた関数は、他の関数の中で定義されたものです。

source: A property is simply some aspect of the object that can be set and/or retrieved.
ja: プロパティとは、設定や取得が可能な、オブジェクトの何らかの側面です。

source: A pseudo-array is actually just a bunch of discrete variables, but with a naming pattern which allows them to be used like elements of an array.
ja: 擬似配列は、実際には単なる離散変数の束ですが、配列の要素のように使用できるような命名パターンを持っています。

source: A pure or binary number is one which is stored in memory in a format that the computer's CPU can directly work with, such as to perform math.
ja: 純粋数または2進数は、コンピュータのCPUが直接演算処理できる形式でメモリに格納されているものです。

source: A statement is simply the smallest standalone element of the language that expresses some action to be carried out.
ja: 文とは、簡単に言えば、実行されるべき何らかのアクションを表現する言語の最小の独立した要素です。

source: A string is simply text.
ja: 文字列は単なるテキストです。

source: A string, or string of characters, is just a text value.
ja: ストリングまたは文字列とは、単なるテキスト値のことです。

source: A subroutine (also sub or procedure) is a reusable block of code which can be executed on demand.
ja: サブルーチン（subまたはprocedure）は、要求に応じて実行できる再利用可能なコードブロックです。

source: A value is simply a piece of information within a program.
ja: 値とは、簡単に言えば、プログラム内の情報のことです。

source: A Catch always belongs to the nearest unclaimed Try statement above it unless a block is used to change that behavior.
ja: Catchは、ブロックを使ってその動作を変更しない限り、常にその上にある最も近い未取得のTry文に属す。

source: A catch always belongs to the nearest unclaimed try statement above it unless a block is used to change that behavior.
ja: catchは、ブロックを使ってその動作を変更しない限り、常にその上にある最も近い未取得のtry文に属す。

source: A modal message box prevents the user from interacting with the GUI window until the message box is dismissed.
ja: モーダルメッセージボックスは、メッセージボックスが解除されるまで、ユーザーがGUIウィンドウと対話することを妨げます。

source: A Finally always belongs to the nearest unclaimed Try statement above it unless a block is used to change that behavior.
ja: Finallyは、ブロックを使ってその動作を変更しない限り、常にその上にある最も近い未取得のTry文に属す。

source: A finally always belongs to the nearest unclaimed try statement above it unless a block is used to change that behavior.
ja: finallyは、ブロックを使ってその動作を変更しない限り、常にその上にある最も近い未取得のtry文に属す。

source: A literal value is one written physically in the script; one that you can see when you look at the code.
ja: リテラル値とは、スクリプトに物理的に書かれた値で、コードを見ればわかる値です。

source: A Class object represents a class definition; it contains static methods and properties.
ja: クラスオブジェクトは、クラス定義を表し、静的メソッドとプロパティを含む。

source: A Map object associates or maps one set of values, called keys, to another set of values.
ja: Mapオブジェクトは、キーと呼ばれる1つの値の集合を、別の値の集合に関連付ける、またはマッピングします。

source: A = Last access time
ja: A＝最終アクセス時刻

source: A COM object may have a "default property", which has two uses:
ja: COMオブジェクトは「デフォルト・プロパティ」を持つことができ、これには2つの用途があります：

source: A COM wrapper object, an interface pointer, or an object with a Ptr property which returns an interface pointer.
ja: COM ラッパーオブジェクト、インターフェースポインタ、またはインターフェースポインタを返すPtrプロパティを持つオブジェクト。

source: A COM wrapper object.
ja: COM ラッパーオブジェクト。

source: A Connector is counted if (and only if) it has at least one Subunit of its own, even if the Subunit is not of the requested type.
ja: コネクタは、それ自身のサブユニットが少なくとも1つあれば（ある場合のみ）、そのサブユニットが要求されたタイプでなくてもカウントされる。

source: A DBGp client is available as a plugin for Notepad++ 32-bit.
ja: DBGp クライアントは、Notepad++ 32-bitのプラグインとして提供されています。

source: A DOS mask may be specified for Name, e.g. ANSI*, Unicode 32*, Unicode 64*, or *bit for all three.
ja: DOSマスクはNameに指定することができる。例えば、3 つすべてについては ANSI*、Unicode 32*、Unicode 64*、または*bitです。

source: A GUI is typically not referenced by name/number (although it can still be named with GuiObj.Name).
ja: GUIは通常、名前/番号で参照されません（ただし、GuiObj.Nameで名前を付けることはできます）。

source: A GUI window may be made the owner of a tooltip by means of the OwnDialogs option.
ja: OwnDialogsオプションによって、GUIウィンドウをツールチップのオーナーにすることができる。

source: A GUI window may be navigated via Tab, which moves keyboard focus to the next input-capable control (controls from which the Tabstop style has been removed are skipped).
ja: GUIウィンドウはTabで移動することができ、キーボードフォーカスは次の入力可能なコントロールに移動します（Tabstopスタイルが削除されたコントロールはスキップされます）。

source: A GUI window may display a modal message box by means of the OwnDialogs option.
ja: GUIウィンドウは、OwnDialogsオプションにより、モーダルメッセージボックスを表示することができる。

source: A GUI window may display a modal file-selection dialog by means of the +OwnDialogs option.
ja: GUIウィンドウは、+OwnDialogsオプションにより、モーダルファイル選択ダイアログを表示することができる。

source: A GUI window may display a modal folder-selection dialog by means of the +OwnDialogs option.
ja: GUIウィンドウは、+OwnDialogsオプションにより、モーダルフォルダ選択ダイアログを表示することができます。

source: A GUI window may display a modal input box by means of OwnDialogs option.
ja: GUIウィンドウは、OwnDialogsオプションによってモーダル入力ボックスを表示することができる。

source: A GUI's HWND is often used with PostMessage, SendMessage, and DllCall.
ja: GUIのHWNDは、PostMessage、SendMessage、DllCallで、よく使われます。

source: A Gui subclass may override __New and call super.__New(Options, Title, this) to handle its own events.
ja: Guiのサブクラスは、__Newをオーバーライドして、独自のイベントを処理するためにsuper.__New(Options, Title, this)をコールすることができます。

source: A List-View is one of the most elaborate controls provided by the operating system.
ja: リストビューは、オペレーティングシステムが提供する最も精巧なコントロールの1つです。

source: A ListView has five viewing modes, of which the most common is report view (which is the default).
ja: ListViewには5つの表示モードがあり、その中で最も一般的なのはレポートビュー（これがデフォルト）です。

source: A ListView is one of the most elaborate controls provided by the operating system.
ja: リストビューは、オペレーティングシステムが提供する最も精巧なコントロールの1つです。

source: A ListView may have up to two ImageLists:
ja: ListViewは、最大2つのImageListを持つことができます：

source: A ListView may have up to two ImageLists: small-icon and/or large-icon.
ja: ListViewは、最大2つのImageListを持つことができます：small-iconおよびlarge-iconのいずれか、または両方を使用します。

source: A ListView or TreeView item is checked or unchecked.
ja: ListViewやTreeViewの項目がチェックされているか、チェックされていないか。

source: A ListView or TreeView item is selected, or a ListView item is deselected.
ja: ListViewまたはTreeViewの項目が選択された場合、またはListViewの項目が非選択の場合。

source: A ListView or TreeView item's label is edited by the user.
ja: ListViewやTreeViewのアイテムのラベルは、ユーザーが編集することができます。

source: A ListView usually looks like this:
ja: ListViewは通常このような形をしています：

source: A ListView with both a large-icon and small-icon ImageList should ensure that both lists contain the icons in the same order.
ja: 大アイコンと小アイコンのImageListを持つListViewは、両方のリストに同じ順序でアイコンを含むことを保証する必要があります。

source: A Map object is an associative array with capabilities similar to the v1 Object, but less ambiguity.
ja: Mapオブジェクトは、v1オブジェクトに似た機能を持つ連想配列ですが、より曖昧さがありません。

source: A MemoryError will also be thrown if the program is unable to allocate enough memory to contain the requested amount of data.
ja: また、要求されたデータ量を格納するのに十分なメモリをプログラムが割り当てられない場合、MemoryErrorがスローされます。

source: A Tree-View displays a hierarchy of items by indenting child items beneath their parents.
ja: ツリービューは、親アイテムの下に子アイテムをインデントすることで、アイテムの階層を表示します。

source: A TreeView item is expanded or collapsed.
ja: TreeViewの項目が展開または折りたたまれている。

source: A TreeView usually looks like this:
ja: TreeViewは通常このような形をしている：

source: A Unicode character code between 0 and 0x10FFFF.
ja: 0 から 0x10FFFF までの Unicode 文字コードです。

source: A VarRef can be used to assign to the original target variable or retrieve its value by dereferencing it.
ja: VarRef は、元のターゲット変数への代入や、参照解除による値の取得に使用することができます。

source: A VarRef can then be used to indirectly access the target variable.
ja: VarRefを使えば、ターゲット変数に間接的にアクセスできる。

source: A Win32 menu is constructed the first time the menu or its parent menu is attached to a GUI or shown.
ja: Win32メニューは、メニューまたはその親メニューがGUIに添付されるか、表示される最初の時に構築されます。

source: A bar with this style has no defined position.
ja: このスタイルのバーは、位置が定義されていない。

source: A base object can be assigned to the base property of another object, but typically an object's base is set implicitly when it is created.
ja: ベース・オブジェクトは他のオブジェクトのベース・プロパティに割り当てることができますが、通常、オブジェクトのベースはオブジェクトが作成されるときに暗黙的に設定されます。

source: A bitmap or icon handle is a numeric value which identifies a bitmap or icon in memory.
ja: ビットマップやアイコンのハンドルは、メモリ上のビットマップやアイコンを識別する数値です。

source: A bitmask of flags to change.
ja: 変更するフラグのビットマスクです。

source: A blank value is also returned whenever the function explicitly omits Return's parameter.
ja: また、関数が明示的にReturnのパラメータを省略した場合は、空白の値が返されます。

source: A block counts as a single group of statements, as does a control flow statement and its body.
ja: ブロックは、制御フロー文とその本体と同様に、1つの文のグループとしてカウントされます。

source: A block is used to bind two or more statements together.
ja: ブロックは、2つ以上の文を結合するために使用されます。

source: A block may be empty (contain zero statements), which may be useful in cases where you want to comment out the contents of the block without removing the block itself.
ja: ブロックは、空（0個のステートメントを含む）であってもよい。これは、ブロック自体を削除せずにブロックの内容をコメントアウトしたい場合に便利です。

source: A boolean value could also represent yes or no, on or off, down or up (such as for GetKeyState) and so on.
ja: ブーリアン値は、イエスか ノーか、オンか オフか、ダウンか アップか（GetKeyStateのように）などを表すこともできる。

source: A brace can be safely used for line continuation with any function call, expression or control flow statement which does not require a body.
ja: 中括弧は、本文を必要としない関数呼び出し、式、制御フロー文であれば、行の継続のために安全に使うことができる。

source: A brace is never interpreted as the beginning of a block if it is preceded by an unclosed (/[/{, since that would produce an invalid expression.
ja: 中括弧の前に閉じない(/[/{がある場合、中括弧はブロックの開始と解釈されることはない。

source: A built-in function is overridden if the script defines its own function of the same name.
ja: スクリプトが同名の関数を定義している場合、組み込み関数はオーバーライドされます。

source: A button is provided that allows the user to create new folders.
ja: 新規にフォルダを作成するためのボタンを用意しました。

source: A callback can prevent this by returning 1 (or true), which will also prevent any remaining callbacks from being called.
ja: コールバックは1（またはtrue）を返すことでこれを防ぐことができ、残りのコールバックが呼ばれるのを防ぐこともできます。

source: A change such as myObj.ans := 42 would be reflected by both myObj.ans and yourObj.ans, since they both refer to the same object.
ja: myObj.ans := 42のような変更は、同じオブジェクトを参照しているため、myObj.ansとyourObj.ansの両方に反映されます。

source: A change to a window's title might be merely temporary if the application that owns the window frequently changes the title.
ja: ウィンドウを所有するアプリケーションが頻繁にタイトルを変更する場合、ウィンドウのタイトルの変更は一時的なものに過ぎないかもしれない。

source: A character class may be followed by *, ?, +, or {min,max}.
ja: 文字クラスは、*、?、+、または{min,max}に続くことができる。

source: A character from the type table below indicating how the input value should be interpreted.
ja: 入力値がどのように解釈されるべきかを示す、以下のタイプテーブルからの文字。

source: A class definition also has the effect of referencing the class.
ja: クラス定義は、クラスを参照する効果もある。

source: A class's Prototype is normally based on the Prototype of its base class, so ClassObj.Prototype.base == ClassObj.base.Prototype.
ja: クラスのPrototypeは、通常、ベースクラスのPrototypeをベースにしているので、ClassObj.Prototype.base == ClassObj.base.Prototype。

source: A column header is clicked.
ja: カラムヘッダがクリックされます。

source: A combination (sum) of the following numbers:
ja: 以下の数字の組み合わせ（合計）：

source: A combination of (at most) two keys is required.
ja: （最大で）2つのキーの組み合わせが必要です。

source: A combination of the above two modes.
ja: 上記2つのモードを組み合わせたもの。

source: A combination of the above.
ja: 上記の組み合わせ。

source: A combination of the three assignments above.
ja: 上記3つの課題の組み合わせ。

source: A comma-separated list of key phrases, any of which will cause the Input to be terminated (in which case EndReason will be set to the word Match).
ja: カンマで区切られたキーフレーズのリストで、どれか一つでもあれば入力は終了します（この場合、EndReasonにはMatchという単語が設定されます）。

source: A command-line client is available from xdebug.org, however this is not suitable for most users as it requires a decent understanding of DBGp (the protocol).
ja: コマンドラインクライアントはxdebug.orgから入手可能ですが、DBGp（プロトコル）を十分に理解する必要があるため、ほとんどのユーザーには適していません。

source: A common issue lots of people have is, they assume that the curly brackets are put in the documentation pages just for fun.
ja: 多くの人が持っている一般的な問題は、中カッコは単に面白半分でドキュメントのページに付けられたものだと思い込んでいることだ。

source: A common use of this statement is an infinite loop that uses the Break statement somewhere in the loop's body to determine when to stop the loop.
ja: この文の一般的な使い方は、無限ループで、ループ本体のどこかにあるBreak文を使って、ループを止めるタイミングを判断するものです。

source: A common use of this statement is an infinite loop that uses the break statement somewhere in the loop's body to determine when to stop the loop.
ja: この文の一般的な使い方は、無限ループで、ループ本体のどこかにあるbreak文を使って、ループを止めるタイミングを判断するものです。

source: A constant is simply an unchangeable value, given a symbolic name.
ja: 定数とは、単に変更不可能な値で、シンボリックな名前が与えられているものです。

source: A continuation operator cannot be used with an auto-replace hotstring or directive other than #HotIf.
ja: 継続演算子は、自動置換ホットストリングや#HotIf以外のディレクティブでは使用できません。

source: A continuation section can be immediately followed by a line containing the open-parenthesis of another continuation section.
ja: 継続セクションの直後に、別の継続セクションの開括弧を含む行を続けることができる。

source: A control's ClassNN can also be determined via Window Spy, MouseGetPos or WinGetControls.
ja: コントロールのClassNNは、Window Spy、MouseGetPos、WinGetControlsで確認することもできます。

source: A control's ClassNN is the name of its window class followed by its sequence number within the top-level window which contains it.
ja: コントロールのClassNNは、コントロールのウィンドウクラスの名前と、それを含むトップレベルウィンドウ内のシーケンス番号で構成されます。

source: A control's HWND is often used with PostMessage, SendMessage, and DllCall.
ja: コントロールのHWNDは、PostMessage、SendMessage、DllCallでよく使用されます。

source: A controller other than first may be used by preceding the button or axis name with the number of the controller.
ja: ボタンまたは軸名の前にコントローラの番号を付けることで、最初以外のコントローラを使用できます。

source: A critical thread becomes interruptible when a message box or other dialog is displayed.
ja: メッセージボックスなどのダイアログが表示されると、クリティカルスレッドが割り込み可能になる。

source: A custom combination of two keys (including mouse but not controller buttons) can be defined by using " & " between them.
ja: 2つのキーの間に「 & 」を使用することで、2つのキーのカスタムコンビネーションを定義することができます。このキーにはマウスボタンを含みますが、ジョイスティックのボタンは含みません。

source: A custom combination of two keys (including mouse but not joystick buttons) can be defined by using " & " between them.
ja: 2つのキー（マウスは含むがジョイスティックボタンは含まない）の間に" & "を使用することで、カスタムな組み合わせを定義することができます。

source: A custom menu item is given a specific priority via the Menu.Add method.
ja: カスタムメニュー項目は、Menu.Addメソッドによって特定の優先順位が与えられます。

source: A custom object can implement multi-dimensional support by defining an __Item property.
ja: カスタム・オブジェクトは、__Itemプロパティを定義することで、多次元サポートを実装することができます。

source: A date-time stamp in the YYYYMMDDHH24MISS format.
ja: YYYYMMDDHH24MISS形式の日付-時間スタンプです。

source: A decimal integer which controls the maximum number of string characters, decimal places, or significant digits to output, depending on the output type.
ja: 出力タイプに応じて、出力する文字列の最大文字数、小数点以下の桁数、または有効桁数を制御する10進数の整数です。

source: A decimal integer which controls the minimum width of the formatted value, in characters.
ja: フォーマットされた値の最小幅を制御する10進数の整数（文字数）。

source: A delay is being performed by Send (most often due to SetKeyDelay), WinActivate, or a Clipboard operation.
ja: Send（多くの場合SetKeyDelayによる）、WinActivate、またはクリップボード操作によって遅延が実行されている。

source: A delay of 0 internally executes a Sleep(0), which yields the remainder of the script's timeslice to any other process that may need it.
ja: 遅延が0のときは、内部的に Sleep(0) が実行され、スクリプトのタイムスライスの残りを、それを必要とする他のプロセスに提供します。

source: A delay of 0 yields the remainder of the script's current timeslice to any other processes that need it (as long as they are not significantly lower in priority than the script).
ja: 遅延を0にすると、スクリプトの現在のタイムスライスの残りを、それを 必要とする他のプロセス(スクリプトより優先順位が著しく低くない限り)に渡す。

source: A delay of length zero is the default, which for SendPlay is the same as -1 (no delay).
ja: 長さ0のディレイがデフォルトで、SendPlayの場合は-1（ディレイなし）と同じです。

source: A delay of length zero is the default.
ja: 長さゼロのディレイがデフォルトです。

source: A dialog box unit is equal to one-fourth of the current dialog box base-width unit.
ja: ダイアログボックス単位は、現在のダイアログボックスのベース幅単位の4分の1に相当する。

source: A direct variable reference.
ja: 直接の変数参照です。

source: A document, URL, executable file (.exe, .com, .bat, etc.), shortcut (.lnk), CLSID, or system verb to launch (see remarks).
ja: 起動する文書、URL、実行ファイル（.exe、.com、.batなど）、ショートカット（.lnk）、CLSID、システム動詞のこと（備考参照）。

source: A document, URL, executable file (.exe, .com, .bat, etc.), shortcut (.lnk), or system verb to launch (see remarks).
ja: 起動する文書、URL、実行ファイル（.exe、.com、.batなど）、ショートカット（.lnk）、システム動詞のこと（備考参照）。

source: A dynamic declaration such as global Array%i% is not possible, since all non-dynamic references to variables such as Array1 or Array99 would have already been resolved to addresses.
ja: Array1やArray99などの変数への非動的な参照は、すでにアドレスに解決されているため、global Array%i% のような動的な宣言は不可能です。

source: A dynamic property with a call accessor function.
ja: コールアクセサー関数を持つダイナミックプロパティです。

source: A dynamic property with a getter which returns a function object.
ja: 関数オブジェクトを返すゲッターを持つダイナミックプロパティです。

source: A dynamic variable reference can also take one or more pieces of literal text and the content of one or more variables, and join them together to form a single variable name.
ja: 動的変数参照は、1つまたは複数のリテラルテキストと1つまたは複数の変数の内容を取り、それらを結合して1つの変数名を形成することもできます。

source: A few functions are able to operate on either a control or a top-level window.
ja: いくつかの機能は、コントロールとトップレベルウィンドウのどちらに対しても操作することができます。

source: A few lines of code can make a simple replacement which returns an InputHook object containing the results instead of using ErrorLevel and an OutputVar.
ja: 数行のコードで、ErrorLevelとOutputVarを使用する代わりに、結果を含むInputHookオブジェクトを返す簡単な置換を行うことができます。

source: A file can be loaded into a variable via FileRead.
ja: FileReadにより、ファイルを変数に読み込むことができます。

source: A file greater than 4 GB in size will cause a MemoryError to be thrown unless the *m option is present, in which case the leading part of the file is loaded.
ja: 4GBを超えるサイズのファイルは、*mオプションが存在しない限り、MemoryErrorが発生し、この場合、ファイルの先頭部分が読み込まれる。

source: A file loop can disrupt itself if it creates or renames files or folders within its own purview.
ja: ファイルループは、自分の権限でファイルやフォルダを作成したり、名前を変更したりすると、それ自体が混乱することがあります。

source: A file loop is useful when you want to operate on a collection of files and/or folders, one at a time.
ja: ファイルループは、ファイルやフォルダの集合体を一度に操作する場合に便利です。

source: A file's last access time might not be as precise on FAT16 & FAT32 volumes as it is on NTFS volumes.
ja: FAT16およびFAT32ボリュームでは、ファイルの最終アクセス時刻はNTFSボリュームほど正確ではないかもしれません。

source: A file-loop can disrupt itself if it creates or renames files or folders within its own purview.
ja: ファイルループは、自分の権限でファイルやフォルダを作成したり、名前を変更したりすると、それ自体が混乱することがあります。

source: A file-loop is useful when you want to operate on a collection of files and/or folders, one at a time.
ja: ファイルループは、ファイルやフォルダの集合体を一度に操作する場合に便利です。

source: A file-reading loop is useful when you want to operate on each line contained in a text file, one at a time.
ja: ファイル読み込みループは、テキストファイルに含まれる行を1行ずつ操作したいときに便利です。

source: A file-selection dialog usually looks like this:
ja: ファイル選択ダイアログは、通常このように表示されます：

source: A folder-selection dialog usually looks like this:
ja: フォルダ選択ダイアログは通常このように表示されます：

source: A for-loop is usually followed by a block, which is a collection of statements that form the body of the loop.
ja: forループの後には、通常、ループの本体を形成するステートメントの集合体であるブロックが続きます。

source: A format string composed of literal text and placeholders of the form {Index:Format}.
ja: {Index:Format}という形式のリテラルテキストとプレースホルダからなるフォーマット文字列です。

source: A function call is said to be dynamic if the target of the call is determined while the script is running, instead of before the script starts.
ja: 関数呼び出しは、スクリプトの開始前ではなく、スクリプトの実行中に呼び出しのターゲットが決定される場合、動的であると言われます。

source: A function call is sometimes called a command, such as if it commands the program to take a specific action.
ja: 関数コールは、プログラムに特定の動作を命令する場合など、コマンドと呼ばれることもあります。

source: A function call statement can span multiple lines.
ja: 関数呼び出し文は、複数の行にまたがることができます。

source: A function can be called by the program in response to some event, such as the user pressing a hotkey.
ja: 関数は、ユーザーがホットキーを押すなど、何らかの事象に反応してプログラムから呼び出されることがあります。

source: A function can be called by the script itself.
ja: 関数は、スクリプト自身から呼び出すことができます。

source: A function can optionally accept parameters.
ja: 関数は、オプションでパラメータを受け取ることができます。

source: A function can optionally accept parameters (inputs) and return a value (output).
ja: 関数は、オプションでパラメータ（入力）を受け取り、値（出力）を返すことができます。

source: A function definition does not need to precede calls to that function.
ja: 関数定義は、その関数への呼び出しの前にある必要はありません。

source: A function failed because its target could not be found.
ja: ターゲットが見つからなかったため、関数が失敗しました。

source: A function is called simply by writing the target function followed by parameters enclosed in parentheses.
ja: 関数が 呼び出されるには、対象となる関数の後に、括弧で囲まれたパラメータを記述するだけでよい。

source: A function is a reusable block of code that can be executed by calling it.
ja: 関数は、呼び出すことで実行可能な再利用可能なコードブロックです。

source: A function may be defined to assume that all its undeclared local variables are static (except its parameters) by making its first line the word "static".
ja: 関数の最初の行を "static"とすることで、宣言されていないローカル変数はすべて（パラメータを除いて）静的であると仮定するように定義することができる。

source: A function object to call automatically whenever Address is called.
ja: Addressが呼び出されるたびに自動的に呼び出される関数オブジェクトです。

source: A function that returns the address of one of the strings that was passed into it might return an identical string in a different memory address than expected.
ja: 渡された文字列のアドレスを返す関数が、期待とは異なるメモリーアドレスに同一の文字列を返すことがあります。

source: A function's optional parameters can be omitted when the function is called, in which case the function may change its behaviour or use a default value.
ja: 関数のオプションパラメータは、関数が呼び出されたときに省略することができます。その場合、関数は動作を変更するか、デフォルト値を使用します。

source: A function/method can assign a value by declaring the parameter ByRef (with &) or by explicit dereferencing.
ja: 関数/メソッドは、パラメータをByRef（&付き）で宣言するか、明示的に再参照することで、値を割り当てることができます。

source: A handle to a Win32 menu (of type HMENU).
ja: Win32メニューのハンドル（HMENU型）です。

source: A hotkey is a key or key combination that triggers an action.
ja: ホットキーは、アクションをトリガーするキーまたはキーの組み合わせです。

source: A hotkey is a key that is hot to the touch.
ja: ホットキーとは、触れると熱くなるキーのこと。

source: A hotkey is created by using a single pair of colons.
ja: ホットキーはコロンのペア一組で作成できます。

source: A hotkey is given a specific priority via the Hotkey function.
ja: ホットキーは、ホットキー機能によって特定の優先順位が与えられます。

source: A hotkey like the following can help analyze your mouse:
ja: 以下のようなホットキーは、マウスの解析に役立ちます。

source: A hotkey like the following can help analyze your mouse: ~WheelDown::ToolTip A_EventInfo
ja: 以下のようなホットキーは、マウスの解析に役立ちます：~WheelDown::ToolTip A_EventInfo

source: A hotkey press will be ignored whenever that hotkey is already running its maximum number of threads (usually 1, but this can be changed with #MaxThreadsPerHotkey).
ja: ホットキーがすでに最大スレッド数（通常は1ですが、#MaxThreadsPerHotkeyで変更可能）を実行している場合は、ホットキーを押しても無視されます。

source: A hotkey's criteria is evaluated each time it is pressed, not when the #HotIf directive is encountered in the code.
ja: ホットキーの条件は、コード内で#HotIfディレクティブに遭遇したときではなく、押されるたびに評価されます。

source: A hotkey's function can be called explicitly by the script only if the function has been named.
ja: ホットキーの機能は、その関数に名前が付けられている場合にのみ、スクリプトから明示的に呼び出すことができます。

source: A hotkey's input level can also be set using the Hotkey function.
ja: ホットキーの入力レベルは、ホットキー機能を使って設定することもできます。
